## **Practical-1:** Create a LabTask6_1.txt file with atleast 10 lines

(a) Stream the data in the file using Python.

In [ ]:
file = open("LabTask6_1.txt")
text = file.readlines()
for line in text:
    print(line)

Python Libraries:

1. numpy

2. pandas

3. matplotlib

4. datetime

5. scipy

6. scikitlearn

7. beautifulsoup

8. requests

9. urllib

(b) Sample odd number lines from the the .txt file.

In [ ]:
for i in range(0,len(text)):
    if i%2 == 0:
        print(text[i])
    else:
        pass

Python Libraries:

2. pandas

4. datetime

6. scikitlearn

8. requests

(c) Randomly sample 30% lines from the .txt file using Python.

In [ ]:
import random
frac = int(0.3*len(text))
txt = random.sample(text, frac)
print(txt)

['6. scikitlearn\n', '4. datetime\n', '5. scipy\n']

(d) Read the .txt file using pandas for parsing

In [ ]:
import pandas as pd
file1 = pd.read_csv("LabTask6_1.txt", header=0)
print(file1)

  Python Libraries:
0          1. numpy
1         2. pandas
2     3. matplotlib
3       4. datetime
4          5. scipy
5    6. scikitlearn
6  7. beautifulsoup
7       8. requests
8         9. urllib

## **Practical-2**:  Create or download any .csv (Comma Separated Value) from the publically available         datasets.

(a) Read the .csv using pandas for parsing.

In [ ]:
csvfile = pd.read_csv("train.csv", header=0)
csvfile.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

(b)Display any two columns from the .csv file

In [ ]:
print(csvfile[["Name", "Age"]])

                                                  Name   Age
0                              Braund, Mr. Owen Harris  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                               Heikkinen, Miss. Laina  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                             Allen, Mr. William Henry  35.0
..                                                 ...   ...
886                              Montvila, Rev. Juozas  27.0
887                       Graham, Miss. Margaret Edith  19.0
888           Johnston, Miss. Catherine Helen "Carrie"   NaN
889                              Behr, Mr. Karl Howell  26.0
890                                Dooley, Mr. Patrick  32.0

[891 rows x 2 columns]

(c) Display any two records (rows) from the .csv file

In [ ]:
csvfile.loc[[23,13], ["Name", "Age"]]

                            Name   Age
23  Sloper, Mr. William Thompson  28.0
13   Andersson, Mr. Anders Johan  39.0

## **Practical-3**: Create or download any.xls file from the publically available datasets with atleast 3 worksheets. Using pandas in Python for parsing,

(a) read sheet2 from .xls and display it.

In [ ]:
excel_file = pd.read_excel("practical 2.xlsx", sheet_name = "Sheet2", header=0)
df2 = pd.DataFrame(excel_file)
df2

    student.id  name  e1.id e1.code  e2.id e2.code
0         1234   joe   1234  CS1500   1234  CS1500
1         1234   joe   1234  CS1500   1234  CS1200
2         1234   joe   1234  CS1500   1234  CS2001
3         1234   joe   1234  CS1500   4000  CS3010
4         1234   joe   1234  CS1500   4000  MA3000
..         ...   ...    ...     ...    ...     ...
70        2000  ling   4000  MA3000   1234  CS1500
71        2000  ling   4000  MA3000   1234  CS1200
72        2000  ling   4000  MA3000   1234  CS2001
73        2000  ling   4000  MA3000   4000  CS3010
74        2000  ling   4000  MA3000   4000  MA3000

[75 rows x 6 columns]

(b)read specific columns from a given excel file

In [ ]:
df2[["e2.code"]]

   e2.code
0   CS1500
1   CS1200
2   CS2001
3   CS3010
4   MA3000
..     ...
70  CS1500
71  CS1200
72  CS2001
73  CS3010
74  MA3000

[75 rows x 1 columns]

(c) add a column named "column1" in the third position of the .xls file (in sheet2) and fill it with NaN values.

In [ ]:
import numpy as np
col1 = pd.DataFrame([np.nan]*75)
col1

     0
0  NaN
1  NaN
2  NaN
3  NaN
4  NaN
..  ..
70 NaN
71 NaN
72 NaN
73 NaN
74 NaN

[75 rows x 1 columns]

In [ ]:
df2.insert(loc=2, column="column1", value=col1)
df2

    student.id  name  column1  e1.id e1.code  e2.id e2.code
0         1234   joe      NaN   1234  CS1500   1234  CS1500
1         1234   joe      NaN   1234  CS1500   1234  CS1200
2         1234   joe      NaN   1234  CS1500   1234  CS2001
3         1234   joe      NaN   1234  CS1500   4000  CS3010
4         1234   joe      NaN   1234  CS1500   4000  MA3000
..         ...   ...      ...    ...     ...    ...     ...
70        2000  ling      NaN   4000  MA3000   1234  CS1500
71        2000  ling      NaN   4000  MA3000   1234  CS1200
72        2000  ling      NaN   4000  MA3000   1234  CS2001
73        2000  ling      NaN   4000  MA3000   4000  CS3010
74        2000  ling      NaN   4000  MA3000   4000  MA3000

[75 rows x 7 columns]